{
    "What is the TDS of your water?": "Our mineral water has an optimal TDS level of 150-300 mg/L, perfectly balanced for health and taste.",
    "What is the ideal calcium quantity in your water?": "Our water contains 40-60 mg/L of calcium, providing essential minerals for bone health.",
    "Why is water purification important?": "We use advanced purification to remove harmful contaminants while retaining beneficial minerals for your health.",
    "How often should I order water bottles?": "For a typical household, we recommend weekly delivery of 10-15 bottles to ensure fresh supply.",
    "What sizes of bottles do you offer?": "We provide 0.5L, 1L, 1.5L bottles and 19L dispensers for home and office use.",
    "Do you offer home delivery in Karachi?": "Yes, we deliver across all areas of Karachi including Clifton, DHA, Gulshan, North Nazimabad, and Saddar.",
    "What are your delivery charges?": "Free delivery for orders above Rs. 500. Below that, Rs. 50 delivery charges apply within city limits.",
    "How long does delivery take?": "Same-day delivery within 2-4 hours for orders placed before 2 PM, next-day for later orders.",
    "What is your minimum order quantity?": "Minimum order is 6 bottles of 1.5L or equivalent volume in other sizes.",
    "Do you have monthly packages?": "Yes, we offer monthly packages with 15% discount and guaranteed weekly delivery.",
    "What is the source of your water?": "We source from protected bore wells in clean areas, tested and approved by Sindh Food Authority.",
    "What purification process do you use?": "7-stage purification: Pre-filtration, Sand filtration, Carbon filtration, RO, UV sterilization, Ozonation, and Mineralization.",
    "Is your water tested regularly?": "Yes, we conduct daily in-house testing and monthly third-party laboratory testing for quality assurance.",
    "What minerals are added to your water?": "We add essential minerals including Calcium, Magnesium, Potassium, and trace amounts of Sodium.",
    "Do you have quality certificates?": "We are certified by Pakistan Standards & Quality Control Authority (PSQCA) and Sindh Food Authority.",
    "What is the pH level of your water?": "Our water maintains an optimal pH of 7.2-7.8, slightly alkaline for better health benefits.",
    "How do you ensure bottle hygiene?": "All bottles are washed with ozonated water, UV sterilized, and sealed in sterile conditions.",
    "What type of bottles do you use?": "We use food-grade PET bottles that are 100% recyclable and BPA-free for safety.",
    "Do you offer corporate delivery?": "Yes, we provide bulk delivery services for offices, schools, hospitals, and events at special rates.",
    "What are your office hours?": "We operate Monday-Saturday 8 AM to 8 PM, Sunday 10 AM to 6 PM for orders and delivery.",
    "Can I track my delivery?": "Yes, you'll receive SMS updates with delivery tracking and estimated arrival time.",
    "Do you offer emergency delivery?": "Emergency same-day delivery available with Rs. 100 extra charges on urgent orders.",
    "What payment methods do you accept?": "We accept cash on delivery, JazzCash, EasyPaisa, bank transfer, and credit/debit cards.",
    "Do you have a subscription service?": "Yes, weekly/monthly subscriptions available with auto-delivery and 10% discount.",
    "What is your return policy?": "Unopened bottles can be returned within 24 hours. Damaged bottles replaced immediately free of charge.",
    "How do you maintain water temperature during delivery?": "Our delivery vehicles are temperature-controlled to maintain freshness, especially in Karachi's heat.",
    "Do you deliver to all areas of Karachi?": "We deliver to all main areas. Some far areas like Malir, Korangi may have additional charges.",
    "What is your contact number for orders?": "Call our hotline 021-XXXXXXX or WhatsApp 03XX-XXXXXXX for instant orders and queries.",
    "Do you offer chilled water delivery?": "Yes, we can deliver pre-chilled bottles for events and special occasions with advance notice.",
    "What is the shelf life of your bottles?": "Our bottles have 12 months shelf life from manufacturing date when stored properly.",
    "How should I store your water bottles?": "Store in cool, dry place away from direct sunlight. Refrigerate after opening and consume within 3 days.",
    "Do you provide water dispensers?": "Yes, we rent out hot/cold water dispensers at Rs. 500/month with free maintenance.",
    "What is your refill service?": "We offer 19L jar refill service at your location with proper sanitization of containers.",
    "Do you test customer's own containers?": "We provide free water quality testing service for customers wanting to test their home water.",
    "What certifications does your plant have?": "PSQCA certified, Halal certified, ISO 9001 quality management, and SFA food safety license.",
    "How often do you service water dispensers?": "Monthly cleaning and servicing included free with dispenser rental, emergency repairs within 24 hours.",
    "Do you offer bulk discounts?": "Yes, 5% discount on orders above Rs. 2000, 10% above Rs. 5000, 15% for monthly contracts.",
    "What is your customer complaint process?": "24/7 complaint hotline, guaranteed response within 2 hours, replacement or refund as appropriate.",
    "Do you deliver during Ramadan?": "Special Ramadan packages available with early morning and evening delivery slots.",
    "What safety measures do you follow during COVID?": "Contactless delivery, sanitized bottles, masked delivery staff, and temperature checks for workers.",
    "Can I visit your plant for inspection?": "Yes, plant visits allowed on weekdays with prior appointment for transparency and quality assurance.",
    "What is your production capacity?": "We produce 10,000 bottles daily with capacity to scale up for bulk orders and events.",
    "Do you supply for events and weddings?": "Yes, special event packages with customized labeling, bulk rates, and on-time delivery guaranteed.",
    "What makes your water different from competitors?": "7-stage purification, optimal mineral balance, temperature-controlled delivery, and local Karachi focus.",
    "Do you offer water analysis reports?": "Free water analysis reports provided monthly to subscription customers showing all quality parameters.",
    "What is your environmental policy?": "We promote bottle recycling, use eco-friendly packaging, and have water conservation practices in production.",
    "Do you have a mobile app for orders?": "Our mobile app launching soon. Currently accept orders via WhatsApp, phone, and website.",
    "What areas do you NOT deliver to?": "We don't deliver beyond Karachi limits. Malir Cantonment and some industrial areas have restricted access.",
    "How do you handle complaints about taste?": "Immediate bottle replacement, source investigation, and batch testing to ensure consistent quality.",
    "What is your peak delivery season?": "Summer months (April-September) see highest demand. We recommend advance booking during peak times.",
    "Do you offer custom labeling?": "Yes, custom labels available for corporate gifts, weddings, and events with minimum 100 bottle orders.",
    "What training do your delivery staff receive?": "All staff trained in food safety, customer service, and proper handling procedures with regular refresher courses.",
    "Do you have seasonal promotions?": "Summer cooling packages, Ramadan special rates, and winter health packages with different pricing.",
    "What is your water source testing frequency?": "Source water tested weekly, finished product tested daily, equipment calibrated monthly for accuracy.",
    "Do you offer water coolers for rent?": "Yes, various models available: basic Rs. 300/month, hot/cold Rs. 500/month, premium Rs. 800/month.",
    "How do you ensure delivery staff reliability?": "Background verified staff, GPS tracking, customer feedback system, and performance-based incentives.",
    "What is your policy on late deliveries?": "Free delivery credit for delays over 30 minutes from promised time, full refund for same-day delivery failures.",
    "Do you deliver on public holidays?": "Limited holiday delivery available for subscription customers with 50% surcharge on delivery fees.",
    "What is your water hardness level?": "Our water has soft to moderate hardness (50-100 mg/L) ideal for drinking and appliance protection.",
    "Do you provide water for construction sites?": "Yes, bulk delivery to construction sites with special industrial rates and flexible payment terms.",
    "How do you maintain cold chain?": "Refrigerated storage, insulated delivery vehicles, and quick delivery times maintain water freshness in Karachi heat.",
    "What is your customer retention rate?": "Over 85% customer retention through consistent quality, reliable service, and competitive pricing.",
    "Do you offer referral bonuses?": "Yes, refer 5 customers get 1 month free delivery, refer 10 customers get 20% annual discount.",
    "What backup do you have for power outages?": "Complete generator backup ensures uninterrupted production and quality during frequent Karachi load shedding.",
    "How do you price your water?": "Competitive pricing: 1.5L at Rs. 25, 19L at Rs. 180, bulk orders and subscriptions get better rates.",
    "What quality checks do bottles undergo?": "Visual inspection, leak testing, weight verification, and batch sampling for laboratory analysis before dispatch.",
    "Do you have partnerships with offices?": "Corporate partnerships with 200+ offices in Karachi providing regular supply with credit facilities.",
    "What is your busiest delivery time?": "Peak hours 10 AM-2 PM and 4-6 PM. Off-peak delivery available with faster service.",
    "How do you handle Karachi traffic delays?": "Multiple delivery routes planned, real-time traffic monitoring, and buffer time included in delivery estimates.",
    "What is your monthly water consumption average?": "Average household consumes 40-60 bottles monthly, offices typically 100-200 bottles depending on staff size.",
    "Do you offer water for mosques?": "Special community rates for mosques, madrassas, and charitable organizations with flexible payment options.",
    "What is your summer demand management?": "Pre-season inventory buildup, temporary staff hiring, and extended operating hours during peak summer demand.",
    "How do you ensure consistent mineral content?": "Automated dosing systems, continuous monitoring, and regular calibration maintain consistent mineral levels.",
    "What is your delivery success rate?": "98.5% on-time delivery rate with real-time tracking and proactive customer communication for delays.",
    "Do you provide water testing equipment?": "TDS meters available for purchase at cost price for customers wanting to monitor water quality.",
    "What is your customer service response time?": "Phone calls answered within 3 rings, WhatsApp responses within 15 minutes during business hours.",
    "How do you handle seasonal water source changes?": "Multiple approved sources ensure consistent supply, seasonal source switching with maintained quality standards.",
    "What is your delivery vehicle maintenance schedule?": "Weekly vehicle inspection, monthly deep cleaning, quarterly mechanical servicing for reliable delivery service.",
    "Do you offer loyalty programs?": "Loyalty points on every purchase, annual customer appreciation events, and exclusive member discounts available.",
    "What is your approach to customer feedback?": "Monthly customer surveys, suggestion box system, and immediate action on quality or service complaints.",
    "How do you maintain water temperature in summer?": "Insulated packaging, pre-chilled bottles, refrigerated vehicles, and quick delivery minimize temperature rise.",
    "What is your contingency plan for equipment breakdown?": "Backup equipment ready, 24/7 maintenance team, alternative production arrangements to ensure continuous supply.",
    "Do you offer educational visits for schools?": "Free educational plant tours for schools teaching students about water purification and safe drinking practices.",
    "What is your market share in Karachi?": "Proud to serve 15,000+ satisfied customers across Karachi with growing market presence in all major areas.",
    "How do you ensure bottle seal integrity?": "Automated sealing with quality checks, tamper-evident caps, and batch tracking for any quality issues.",
    "What is your annual production volume?": "Annual production capacity of 3.6 million bottles with scalability for growing Karachi market demand.",
    "Do you have plans for expansion?": "Plans for additional plants in Lahore and Islamabad, plus increasing Karachi capacity by 50% next year.",
    "What is your waste management policy?": "Zero liquid waste discharge, plastic recycling program, and partnership with recycling companies for sustainability.",
    "How do you handle customer data privacy?": "Strict data protection policies, secure customer databases, and no sharing of personal information with third parties.",
    "What is your average delivery time in different areas?": "Clifton/DHA: 1-2 hours, Gulshan/FB Area: 2-3 hours, North Karachi: 3-4 hours, depending on traffic.",
    "Do you offer internships or plant visits for students?": "Educational internships available for food technology students, plus guided plant tours for academic learning.",
    "What is your social responsibility program?": "Free water supply to flood victims, partnerships with NGOs, and subsidized rates for underprivileged communities.",
    "How do you measure customer satisfaction?": "Regular surveys, online reviews monitoring, complaint resolution tracking, and annual customer satisfaction index.",
    "What is your vision for next 5 years?": "Become Karachi's most trusted water brand, expand to major Pakistani cities, and lead in sustainable packaging innovation.",
    "Aap ka plant kahan hai?": "Hamara plant Allah Wala Town Korangi mein hai, address L-734. Aap visit kar sakte hain appointment ke saath.",
    "Korangi se delivery kitne time mein hoti hai?": "Korangi ke andar 30-45 minutes, bahar ke areas mein 1-2 hours lagta hai traffic ke hisab se.",
    "Pani mein namak zyada to nahi?": "Bilkul nahi, hum balanced minerals add karte hain. Namak ka level bilkul theek hai, taste bhi achha hota hai.",
    "Ye pani peene se pathar to nahi banenge?": "Nahi bilkul, hamara pani soft hai aur proper treatment ke baad minerals add kiye jaate hain, pathar nahi banate.",
    "Ghar ke paani se aap ka pani kitna behtar hai?": "Ghar ka paani mostly contaminated hota hai. Hamara 7-stage treatment se saaf hota hai, minerals balanced hain.",
    "Ramzan mein delivery timing kya hogi?": "Ramzan mein subah 6-11 baje aur shaam 5-9 baje delivery hoti hai iftar se pehle.",
    "Pani thanda milta hai ya room temperature?": "Room temperature milta hai, lekin advance order pe thanda bhi deliver kar sakte hain events ke liye.",
    "Aap ke paas medical certificate hai?": "Haan, PSQCA, Sindh Food Authority aur health department ke saare certificates hain plant mein.",
    "Bottle ki plastic safe hai?": "Haan bilkul, food grade PET plastic use karte hain jo bilkul safe hai, BPA free hai.",
    "Pani mein fluoride hai ya nahi?": "Natural minerals add karte hain, fluoride ka level WHO standards ke according safe range mein hai.",
    "Gharelu paani purifier se kya fark hai?": "Home purifier mein regular maintenance zaroori hai, hamara plant level pe testing hoti hai har roz.",
    "Baarish ke paani se kya ye behtar hai?": "Haan bilkul, baarish ka paani contaminated hota hai, hamara scientifically treated aur tested hai.",
    "Motor paani se ye pani kaise alag hai?": "Motor paani mein heavy metals aur bacteria hote hain, hamara RO aur UV se completely safe banaya jaata hai.",
    "Delivery boy trustworthy hain?": "Haan, saare delivery boys ka police verification hai aur proper training di gayi hai.",
    "COD available hai ya advance payment chahiye?": "COD available hai, JazzCash, EasyPaisa bhi accept karte hain. Monthly customers ko credit facility bhi dete hain.",
    "Korangi ke industrial area mein deliver karte hain?": "Haan karte hain, lekin kuch restricted areas hain. Call kar ke confirm kar lein pehle.",
    "Bottle return kar sakte hain agar taste pasand nahi aya?": "Haan, 24 ghante mein unopened bottles return ho sakti hain ya replacement mil sakta hai.",
    "Eid pe delivery hoti hai?": "Limited delivery hoti hai Eid ke din, advance booking zaroori hai special charges ke saath.",
    "Paani peene se health improve hoti hai?": "Balanced minerals se digestion theek hoti hai, skin bhi achhi lagti hai, overall health ke liye faaydemand hai.",
    "Home delivery mein paani kharab to nahi hota?": "Bilkul nahi, hamari delivery vehicles temperature controlled hain, bottles sealed rehti hain.",
    "Pregnant ladies ke liye safe hai?": "Haan bilkul safe hai, minerals balance hain jo pregnant ladies ke liye zaroori hain.",
    "Bachon ke liye koi separate pani hai?": "Same pani hai jo bachon ke liye perfect hai, minerals unki growth ke liye achhe hain.",
    "Sugar patients ye pani pee sakte hain?": "Haan, sugar free hai aur minerals natural hain jo diabetes patients ke liye safe hai.",
    "BP ke patients ke liye safe hai?": "Sodium ka level controlled hai, BP patients safely pee sakte hain, doctor se bhi confirm kar sakte hain.",
    "Office mein cooler lagvana ho to kya karna hoga?": "Cooler rent pe milta hai Rs. 500 monthly, installation free, monthly servicing included hai.",
    "Masjid ke liye special rate hai?": "Haan, masjid aur community centers ke liye 20% discount aur flexible payment options hain.",
    "School delivery karte hain?": "Haan, schools mein bulk delivery karte hain educational rates pe, payment terms flexible hain.",
    "Wedding mein kitne bottles chahiye honge?": "200 guests ke liye 100-150 bottles enough hain, custom labeling bhi kar sakte hain.",
    "Load shedding mein production kaise chalta hai?": "Generator backup hai 24/7, kabhi production band nahi hoti light jane se.",
    "Summers mein demand zyada hoti hai?": "Haan, March se September tak heavy demand hai, advance booking recommend karte hain.",
    "Pani mein germs to nahi hote?": "Bilkul nahi, UV treatment se saare germs mar jaate hain, ozonation se complete sterilization hoti hai.",
    "DHA ya Clifton mein deliver karte hain Allah Wala Town se?": "Haan, Karachi ke saare main areas mein deliver karte hain, distance ke hisab se timing hoti hai.",
    "Mehngai ke wajah se rates barh rahe hain?": "Rates stable rakhne ki koshish karte hain, bulk orders aur monthly packages mein discount milta hai.",
    "Competitors se aap kaise alag hain?": "Local plant hai, fresh production, proper certificates, aur Korangi area mein sabse fast delivery.",
    "Plant mein kaam karne wale log trained hain?": "Haan, saare workers ko food safety aur hygiene ki proper training di gayi hai.",
    "Quality control kaise karte hain daily?": "Har batch ka testing hota hai, TDS, pH, minerals check karte hain before packaging.",
    "Bottles ki cleaning kaise hoti hai?": "Ozone water se washing, UV sterilization, aur sterile environment mein sealing hoti hai.",
    "Purane bottles reuse karte hain?": "Nahi, har bottle new hai. Customers se empty bottles wapas lete hain recycling ke liye.",
    "Allah Wala Town mein aur competitors hain?": "Hain, lekin hamari quality aur service sabse achhi hai, customer reviews check kar sakte hain.",
    "Night time emergency delivery hoti hai?": "Limited emergency delivery hoti hai extra charges ke saath hospitals aur urgent cases ke liye.",
    "Paani freeze kar sakte hain?": "Haan kar sakte hain, lekin plastic bottles freeze karne se damage ho sakti hai, glass mein behtar.",
    "Transport cost zyada areas mein extra lagta hai?": "Malir, Gulshan-e-Maymar jaisi door areas mein Rs. 50-100 extra charges lag sakte hain.",
    "WhatsApp pe order kaise karein?": "03122447873 pe WhatsApp karein, location, quantity, aur timing bata dein, confirm ho jayega.",
    "Monthly customers ko kya benefits milte hain?": "10-15% discount, priority delivery, free dispenser, aur quality guarantee milti hai.",
    "Complaint karne ke liye kya process hai?": "Hotline pe call karein ya WhatsApp message, 2 ghante mein response guarantee hai.",
    "Production timing kya hai daily?": "24/7 production chalta hai, fresh bottles har din ready hoti hain delivery ke liye.",
    "Allah Wala Town mein office visit kar sakte hain?": "Haan, plant office L-734 pe aa sakte hain working hours mein appointment ke saath.",
    "Credit facility available hai regular customers ko?": "Haan, 6 months regular customers ko monthly billing aur credit facility dete hain.",
    "Social media pe aap ka page hai?": "Facebook aur Instagram pe page hai, latest updates aur customer reviews dekh sakte hain.",
    "Delivery tracking kaise karte hain?": "SMS notification milta hai dispatch ke time, aur delivery boy ka contact number share karte hain.",
    "Where are you located?": "We are located in Allah Wala Town near Gulzar e Fatima mosque, Korangi, Karachi."
  }